In [ ]:
import pandas as pd

In [8]:
animals = ['tiger' , 'lion' , 'sheep' , 'keewee']
p_animals = pd.Series(animals)
print(p_animals)
print(type(p_animals))

0     tiger
1      lion
2     sheep
3    keewee
dtype: object
<class 'pandas.core.series.Series'>

In [9]:
animals = {
    'n1':'bear',
    'n2' :'lion',
    'n3' : 'keewee'
}
p_animals = pd.Series(animals)
p_animals

n1      bear
n2      lion
n3    keewee
dtype: object

In [11]:
p_animals.iloc[2]

'keewee'

In [12]:
p_animals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [13]:
p_animals.values

array(['bear', 'lion', 'keewee'], dtype=object)

In [14]:
p_animals['n1']

'bear'

In [15]:
for item in p_animals:
    print(f'hello mr {item}')

hello mr bear
hello mr lion
hello mr keewee

In [ ]:
frame = [1,2,3,4,5,6]
p_frame = pd.Series(frame)

p_frame.sum()

21

In [24]:
f_animals = pd.Series({
    'n1':'bear',
    'n2':'lion',
    'n3': 'tiger'
})
f_animals_2 = pd.Series({
    'n1':'bear_2',
    'n2':'lion_2',
    'n3': 'tiger_2'
})
f_animals_3 = pd.Series({
    'n1':'bear_3',
    'n2':'lion_3',
    'n3': 'tiger_3'
})
df = pd.DataFrame([f_animals , f_animals_2 , f_animals_3] , index = ['r1' , 'r2' , 'r3'])
df

        n1      n2       n3
r1    bear    lion    tiger
r2  bear_2  lion_2  tiger_2
r3  bear_3  lion_3  tiger_3

In [25]:
df.loc['r2']

n1     bear_2
n2     lion_2
n3    tiger_2
Name: r2, dtype: object

In [27]:
df.loc['r2'].loc['n2']

'lion_2'

In [28]:
df.loc['r2' , 'n2']

'lion_2'

In [29]:
df['n2']

r1      lion
r2    lion_2
r3    lion_3
Name: n2, dtype: object

In [30]:
df.T

       r1       r2       r3
n1   bear   bear_2   bear_3
n2   lion   lion_2   lion_3
n3  tiger  tiger_2  tiger_3

In [32]:
df[['n2']]

        n2
r1    lion
r2  lion_2
r3  lion_3

In [33]:
df.drop('r1')  #inplace = False

        n1      n2       n3
r2  bear_2  lion_2  tiger_2
r3  bear_3  lion_3  tiger_3

In [36]:
df.loc[: , ['n2' , 'n3']]

        n2       n3
r1    lion    tiger
r2  lion_2  tiger_2
r3  lion_3  tiger_3

In [37]:
f_animals = pd.Series({
    'n1':'bear',
    'n2':'lion',
    'n3': 'tiger'
})
f_animals_2 = pd.Series({
    'n1':'bear_2',
    'n2':'lion_2',
    'n3': 'tiger_2'
})
f_animals_3 = pd.Series({
    'n1':'bear_3',
    'n2':'lion_3',
    'n3': 'tiger_3'
})
df = pd.DataFrame([f_animals , f_animals_2 , f_animals_3] , index = ['r1' , 'r2' , 'r3'])
df

        n1      n2       n3
r1    bear    lion    tiger
r2  bear_2  lion_2  tiger_2
r3  bear_3  lion_3  tiger_3

In [38]:
df['n1'] = 1
df

    n1      n2       n3
r1   1    lion    tiger
r2   1  lion_2  tiger_2
r3   1  lion_3  tiger_3

In [42]:
df['n1']* 2

r1    2
r2    2
r3    2
Name: n1, dtype: int64